#!/bin/bash

pwd="$(realpath "$(dirname "$0")")"
source "$pwd/linux/jiasuqi.conf"

echo
echo ===================================================================
echo "请输入要加速的游戏程序文件名（如Wow.exe）。"
echo "注意：应该输入实际游戏进程的文件名（比如Wow.exe），不是游戏启动器的文件名（比如Battle.net.exe）。"
echo "如果游戏文件名输错，加速可能不会生效。"
echo ===================================================================
echo

read -p "要加速的游戏程序: " exe_name

if [ "$exe_name" = "" ]; then
    echo
    echo ===================================================================
    echo "您未输入要加速的游戏程序，加速器无法启动。"
    echo ===================================================================
    echo
    exit
fi

exe_name="$(basename "$exe_name")"

echo "要加速的游戏程序: $exe_name"
echo "为保证加速效果，Linux上的IPv6功能将被暂时关闭，重启后可恢复。"

echo
echo ===================================================================
echo 请等待虚拟机开机并进入桌面。
echo 如果进入桌面后脚本还是没反应，请双击桌面上的“重启SSH服务.bat”。
echo 如果虚拟机内的Windows损坏，无法进入桌面，请删除当前文件夹，并从压缩包里重新解压。
echo ===================================================================
echo

echo "启动虚拟机……"
"$pwd/vm-cli.sh" &

echo
echo ===================================================================
echo

echo "等待虚拟机SSH服务启动……"
"$pwd/linux/wait-for-it.sh" -h $VM_IP_ADDR -p 22 -t 0

echo
echo ===================================================================
echo "初始化代理……"
echo "注意：初始化完成后，Linux将暂时无法联网。"
echo "你需要在Windows桌面双击“启动代理.bat”，或者在本终端按Ctrl+C停止代理，才能恢复联网。"
echo ===================================================================
echo

sudo "$pwd/linux/jiasuqi" "$VM_IP_ADDR" "$exe_name"

echo
echo ===================================================================
echo
